{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8be829cf-09df-4c74-97fd-6a46f9c0611d",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "from transformers import AutoModelForCausalLM, AutoTokenizer, pipeline\n",
    "\n",
    "model_name_or_path = \"TheBloke/Mistral-7B-codealpaca-lora-GPTQ\"\n",
    "# To use a different branch, change revision\n",
    "# For example: revision=\"gptq-4bit-32g-actorder_True\"\n",
    "model = AutoModelForCausalLM.from_pretrained(model_name_or_path,\n",
    "                                             device_map=\"auto\",\n",
    "                                             trust_remote_code=False,\n",
    "                                             revision=\"main\")\n",
    "\n",
    "tokenizer = AutoTokenizer.from_pretrained(model_name_or_path, use_fast=True)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0517bf69-a118-49b2-883a-67c33766b99b",
   "metadata": {},
   "outputs": [],
   "source": [
    "pipe = pipeline(\n",
    "    \"text-generation\",\n",
    "    model=model,\n",
    "    tokenizer=tokenizer,\n",
    "    max_new_tokens=512,\n",
    "    do_sample=True,\n",
    "    temperature=0.7,\n",
    "    top_p=0.95,\n",
    "    top_k=40,\n",
    "    repetition_penalty=1.1\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "fcee8e33-9576-4067-9944-956fab1c2dbf",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Below is an instruction that describes a task. Write a response that appropriately completes the request. please encolse the code in ``` and only show code not the detail\n",
      "\n",
      "### Instruction:\n",
      "Write a SPARQL code for the following natural language quesiont that run on DBpedia: What is the capital of Germany?\n",
      "\n",
      "### Response:\n",
      " Here's the SPARQL query to get the capital of Germany from DBpedia:\n",
      "\n",
      "```sparql\n",
      "PREFIX dbpedia_property_10000041 AS \"http://dbpedia.org/ontology/ property/capital\"\n",
      "PREFIX dbpedia_object AS \"http://dbpedia.org/ontology/ Germany\"\n",
      "SELECT?capital\n",
      "WHERE {\n",
      " ?x dbo:isMeronym?dbo:country.\n",
      " ?x dbpedia_property_10000041?capital.\n",
      " ?x dbo:isMeronym?dbo:country.\n",
      " ?y dbo:wikiPage?dbo:country.\n",
      " ?y dbo:wikiLink?y.\n",
      " ?y dbo:wikiLink?x.\n",
      "  SELECT?capital\n",
      "  WHERE {\n",
      "   ?y dbo:hasDbID?dbo:WIKI_PAGE_ID.\n",
      "   ?y dbo:hasDbID?dbo:WIKI_PAGE_ID.\n",
      "    FILTER(ABS(STRFIND(str(?y), \"wikipedia\") - str(?y)) = 0)\n",
      "  }\n",
      "}\n",
      "```\n",
      "\n",
      "This code uses DBpedia's ontology to find the object with the property \"capital\", which is \"Germany\". Then it filters the result to make sure that the object is a wiki page, and that the string representation of the URI contains the word \"wikipedia\".\n"
     ]
    }
   ],
   "source": [
    "prompt = \"Write a SPARQL code for the following natural language quesiont that run on DBpedia: What is the capital of Germany?\"\n",
    "prompt_template=f'''Below is an instruction that describes a task. Write a response that appropriately completes the request. please encolse the code in ``` and only show code not the detail\n",
    "\n",
    "### Instruction:\n",
    "{prompt}\n",
    "\n",
    "### Response:\n",
    "'''\n",
    "\n",
    "\n",
    "\n",
    "print(pipe(prompt_template)[0]['generated_text'])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "ab2f40ad-a547-4e6e-8b80-bd9626f678f5",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def generate_sparql(question): \n",
    "    prompt = \"generate a sparql query for the input question:\" + str(question)\n",
    "    prompt_template=f'''Below is an instruction that describes a task. Write a response that appropriately completes the request. please encolse the code in ``` and only show code not the detail\n",
    "\n",
    "    ### Instruction:\n",
    "    {prompt}\n",
    "\n",
    "    ### Response:\n",
    "    '''\n",
    "    response = pipe(prompt_template)[0]['generated_text']\n",
    "    \n",
    "    if '### Response:' in response:\n",
    "        s = response.split('### Response:')[1]\n",
    "        if \"```\" in s:\n",
    "            return s.split('```')[1]\n",
    "        else:\n",
    "            return s\n",
    "    else:\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "4e37410c-3fbf-444d-a02e-e29777c0b73e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/upb/users/m/manzoor/profiles/unix/cs/.conda/envs/sparqlgen/lib/python3.10/site-packages/transformers/pipelines/base.py:1101: UserWarning: You seem to be using the pipelines sequentially on GPU. In order to maximize efficiency please use a dataset\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'\\n    PREFIX dbo: <http://dbpedia.org/ontology/>\\n    SELECT?capital \\n    WHERE {\\n       ?country dbo:countryType \"Pakistan\".\\n       ?country dbo:capital?capital \\n    }\\n    '"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generate_sparql(\"What is the capital of Pakistan?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "1eb156b1-5561-4a56-8108-c92f3b3b7d33",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b8a60c2e-77f7-43bb-bb37-62a9551b0f07",
   "metadata": {},
   "source": [
    "### Experiment 01 on misteral code for wikidata LCQuad"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "07b4bdf6-3e80-4591-8153-98fb648aa596",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_lcquad = pd.read_csv('Output/exp1_prompt_output_lcquad.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "f8582971-6880-4002-9ff7-fbe41ed3dc3c",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5969"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(df_lcquad)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "6963f04c-5b7b-49a4-aa41-8051db610670",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Unnamed: 0', 'questions', 'sparql_lcquad', 'output'], dtype='object')"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_lcquad.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "df624e52-3cdf-42a5-88a8-2a40fa550c88",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 21951.621829986572 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "df_lcquad['mistral_sparql'] = df_lcquad[\"questions\"].apply(generate_sparql)\n",
    "end_time = time.time()\n",
    "elapsed_time = end_time - start_time\n",
    "print(f\"Execution time: {elapsed_time} seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "4c0ffdbe-4101-4d1f-a5f0-0060127cf1b7",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "import nltk\n",
    "from nltk.translate.bleu_score import sentence_bleu\n",
    "\n",
    "#nltk.download('punkt')\n",
    "\n",
    "for index, row in df_lcquad.iterrows():\n",
    "    \n",
    "    reference = nltk.word_tokenize(row['sparql_lcquad'].lower())\n",
    "    if len(row['mistral_sparql']) < 1:\n",
    "        print(index)\n",
    "        continue\n",
    "    candidate = nltk.word_tokenize(row['mistral_sparql'].lower())\n",
    "    bleu_score = sentence_bleu([reference], candidate[1:])\n",
    "    df_lcquad.at[index, 'Org_bleu_score'] = bleu_score"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "e4abd010-4ed0-40b5-84ae-fc21d0e2721a",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.008710084499626892"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "average_bleu = df_lcquad['Org_bleu_score'].mean()\n",
    "average_bleu"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "98c67585-97e0-498b-a5f7-442e1087c3d8",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_lcquad.to_csv('Output/exp1_mistrel_lcquad.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62cd54ad-8236-477c-8c4c-cea43eb77daf",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Experiment 01 on misteral code for dbpedia qald"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "1eefe32a-4e4b-4e7d-9882-437270fe9f62",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_qald = pd.read_csv('Output/exp1_prompt_output_qald.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "60fdc547-a6e5-4e1e-aa78-f68ea5ed4256",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "150"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(df_qald)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "342062ba-dd0f-4fa0-b00f-d6165b58fcff",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>id</th>\n",
       "      <th>questions</th>\n",
       "      <th>sparql_qald</th>\n",
       "      <th>sparql_gen</th>\n",
       "      <th>output</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>what is the time zone of salt lake city?</td>\n",
       "      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PRE...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { res:Salt_Lake_Cit...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>who killed caesar?</td>\n",
       "      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri dct:subject ...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>what is the highest mountain in germany?</td>\n",
       "      <td>PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-sc...</td>\n",
       "      <td>SELECT ?uri WHERE { ?uri rdf:type onto:Mountai...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>which american presidents were in office durin...</td>\n",
       "      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PRE...</td>\n",
       "      <td>SELECT ?uri WHERE { ?uri dct:subject dbc:Presi...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>butch otter is the governor of which u.s. state?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://db...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri a yago:Wikic...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Unnamed: 0  id                                          questions  \\\n",
       "0           0   1           what is the time zone of salt lake city?   \n",
       "1           1   2                                 who killed caesar?   \n",
       "2           2   3           what is the highest mountain in germany?   \n",
       "3           3   4  which american presidents were in office durin...   \n",
       "4           4   5   butch otter is the governor of which u.s. state?   \n",
       "\n",
       "                                         sparql_qald  \\\n",
       "0  PREFIX res: <http://dbpedia.org/resource/> PRE...   \n",
       "1  PREFIX dct: <http://purl.org/dc/terms/> PREFIX...   \n",
       "2  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-sc...   \n",
       "3  PREFIX dbo: <http://dbpedia.org/ontology/> PRE...   \n",
       "4  SELECT DISTINCT ?uri WHERE { ?uri a <http://db...   \n",
       "\n",
       "                                          sparql_gen  \\\n",
       "0  SELECT DISTINCT ?uri WHERE { res:Salt_Lake_Cit...   \n",
       "1  SELECT DISTINCT ?uri WHERE { ?uri dct:subject ...   \n",
       "2  SELECT ?uri WHERE { ?uri rdf:type onto:Mountai...   \n",
       "3  SELECT ?uri WHERE { ?uri dct:subject dbc:Presi...   \n",
       "4  SELECT DISTINCT ?uri WHERE { ?uri a yago:Wikic...   \n",
       "\n",
       "                                              output  \n",
       "0  [INST] \\nYou are given an input question, conv...  \n",
       "1  [INST] \\nYou are given an input question, conv...  \n",
       "2  [INST] \\nYou are given an input question, conv...  \n",
       "3  [INST] \\nYou are given an input question, conv...  \n",
       "4  [INST] \\nYou are given an input question, conv...  "
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_qald.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "3b1a28bf-90ab-4dd6-bc4e-f3b253b5cab7",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 577.8442919254303 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "df_qald['mistral_sparql'] = df_qald[\"questions\"].apply(generate_sparql)\n",
    "end_time = time.time()\n",
    "elapsed_time = end_time - start_time\n",
    "print(f\"Execution time: {elapsed_time} seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "952b1561-7445-4adc-b29c-c225ce653e72",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "for index, row in df_qald.iterrows():\n",
    "    \n",
    "    reference = nltk.word_tokenize(row['sparql_qald'].lower())\n",
    "    if len(row['mistral_sparql']) < 1:\n",
    "        print(index)\n",
    "        continue\n",
    "    candidate = nltk.word_tokenize(row['mistral_sparql'].lower())\n",
    "    bleu_score = sentence_bleu([reference], candidate[1:])\n",
    "    df_qald.at[index, 'Org_bleu_score'] = bleu_score"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "b95f39dd-3d20-4de0-8ce1-742a66018b6e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.045427155815744"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "average_bleu = df_qald['Org_bleu_score'].mean()\n",
    "average_bleu"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "11d16304-f158-4b4f-b306-4fb1a3929974",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>id</th>\n",
       "      <th>questions</th>\n",
       "      <th>sparql_qald</th>\n",
       "      <th>sparql_gen</th>\n",
       "      <th>output</th>\n",
       "      <th>mistral_sparql</th>\n",
       "      <th>Org_bleu_score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>what is the time zone of salt lake city?</td>\n",
       "      <td>PREFIX res: &lt;http://dbpedia.org/resource/&gt; PRE...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { res:Salt_Lake_Cit...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "      <td>\\n    PREFIX dbdp: &lt;http://dbpedia.org/dataset...</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>who killed caesar?</td>\n",
       "      <td>PREFIX dct: &lt;http://purl.org/dc/terms/&gt; PREFIX...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri dct:subject ...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "      <td>\\n    Prefixes: \\n      dbo: &lt;http://dbpedia.o...</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>what is the highest mountain in germany?</td>\n",
       "      <td>PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-sc...</td>\n",
       "      <td>SELECT ?uri WHERE { ?uri rdf:type onto:Mountai...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "      <td>\\n    PREFIX dbo: &lt;http://dbpedia.org/onto&gt;\\n ...</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>which american presidents were in office durin...</td>\n",
       "      <td>PREFIX dbo: &lt;http://dbpedia.org/ontology/&gt; PRE...</td>\n",
       "      <td>SELECT ?uri WHERE { ?uri dct:subject dbc:Presi...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "      <td>sparql\\n    PREFIX dbdw WHERE {\\n    SELECT DI...</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>butch otter is the governor of which u.s. state?</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri a &lt;http://db...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { ?uri a yago:Wikic...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "      <td>\\n    PREFIX dbo &lt;http://dbpedia.org/ontology/...</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Unnamed: 0  id                                          questions  \\\n",
       "0           0   1           what is the time zone of salt lake city?   \n",
       "1           1   2                                 who killed caesar?   \n",
       "2           2   3           what is the highest mountain in germany?   \n",
       "3           3   4  which american presidents were in office durin...   \n",
       "4           4   5   butch otter is the governor of which u.s. state?   \n",
       "\n",
       "                                         sparql_qald  \\\n",
       "0  PREFIX res: <http://dbpedia.org/resource/> PRE...   \n",
       "1  PREFIX dct: <http://purl.org/dc/terms/> PREFIX...   \n",
       "2  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-sc...   \n",
       "3  PREFIX dbo: <http://dbpedia.org/ontology/> PRE...   \n",
       "4  SELECT DISTINCT ?uri WHERE { ?uri a <http://db...   \n",
       "\n",
       "                                          sparql_gen  \\\n",
       "0  SELECT DISTINCT ?uri WHERE { res:Salt_Lake_Cit...   \n",
       "1  SELECT DISTINCT ?uri WHERE { ?uri dct:subject ...   \n",
       "2  SELECT ?uri WHERE { ?uri rdf:type onto:Mountai...   \n",
       "3  SELECT ?uri WHERE { ?uri dct:subject dbc:Presi...   \n",
       "4  SELECT DISTINCT ?uri WHERE { ?uri a yago:Wikic...   \n",
       "\n",
       "                                              output  \\\n",
       "0  [INST] \\nYou are given an input question, conv...   \n",
       "1  [INST] \\nYou are given an input question, conv...   \n",
       "2  [INST] \\nYou are given an input question, conv...   \n",
       "3  [INST] \\nYou are given an input question, conv...   \n",
       "4  [INST] \\nYou are given an input question, conv...   \n",
       "\n",
       "                                      mistral_sparql  Org_bleu_score  \n",
       "0  \\n    PREFIX dbdp: <http://dbpedia.org/dataset...             0.0  \n",
       "1  \\n    Prefixes: \\n      dbo: <http://dbpedia.o...             0.0  \n",
       "2  \\n    PREFIX dbo: <http://dbpedia.org/onto>\\n ...             0.0  \n",
       "3  sparql\\n    PREFIX dbdw WHERE {\\n    SELECT DI...             0.0  \n",
       "4  \\n    PREFIX dbo <http://dbpedia.org/ontology/...             0.0  "
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_qald.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "fa78bbde-409b-4ccd-a99b-faee85753b22",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_qald.to_csv('Output/exp1_mistrel_qald.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c0561451-a8b1-4c7d-a30d-937274c026e6",
   "metadata": {},
   "source": [
    "### Experiment 01 on misteral code for dbpedia Vquanda"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "4dd99fce-298d-4776-a1ee-7118ba22b00e",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_vquanda = pd.read_csv('Output/exp1_prompt_output_vquanda.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "9469a7f4-aca7-4cbb-b81f-5f0cfea386fb",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1000"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(df_vquanda)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "7ebafb16-8100-45b1-80ea-ec8da927c4d4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>questions</th>\n",
       "      <th>sparql_vquanda</th>\n",
       "      <th>output</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Count the number of people became famous for w...</td>\n",
       "      <td>SELECT DISTINCT COUNT(?uri) WHERE { ?x &lt;http:/...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Which location city of Denver Broncos is the p...</td>\n",
       "      <td>SELECT DISTINCT ?uri WHERE { &lt;http://dbpedia.o...</td>\n",
       "      <td>[INST] \\nYou are given an input question, conv...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Unnamed: 0                                          questions  \\\n",
       "0           0  Count the number of people became famous for w...   \n",
       "1           1  Which location city of Denver Broncos is the p...   \n",
       "\n",
       "                                      sparql_vquanda  \\\n",
       "0  SELECT DISTINCT COUNT(?uri) WHERE { ?x <http:/...   \n",
       "1  SELECT DISTINCT ?uri WHERE { <http://dbpedia.o...   \n",
       "\n",
       "                                              output  \n",
       "0  [INST] \\nYou are given an input question, conv...  \n",
       "1  [INST] \\nYou are given an input question, conv...  "
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_vquanda.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "cf5b0533-1907-431c-bf4a-d46acd1919ae",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/upb/users/m/manzoor/profiles/unix/cs/.conda/envs/sparqlgen/lib/python3.10/site-packages/transformers/pipelines/base.py:1101: UserWarning: You seem to be using the pipelines sequentially on GPU. In order to maximize efficiency please use a dataset\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 4327.619374036789 seconds\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "df_vquanda['mistral_sparql'] = df_vquanda[\"questions\"].apply(generate_sparql)\n",
    "end_time = time.time()\n",
    "elapsed_time = end_time - start_time\n",
    "print(f\"Execution time: {elapsed_time} seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "e9dd18e7-ac98-48f6-9917-637cfeacc085",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "for index, row in df_vquanda.iterrows():\n",
    "    \n",
    "    \n",
    "    reference = nltk.word_tokenize(row['sparql_vquanda'].lower())\n",
    "    \n",
    "    if len(row['mistral_sparql']) < 1:\n",
    "        print(index)\n",
    "        continue\n",
    "    candidate = nltk.word_tokenize(row['mistral_sparql'].lower())\n",
    "    \n",
    "    bleu_score = sentence_bleu([reference], candidate[1:])\n",
    "    df_vquanda.at[index, 'Org_bleu_score'] = bleu_score\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "2704ad82-5b17-4129-873a-ee70a1ebef28",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.005678455490788355"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "average_bleu = df_vquanda['Org_bleu_score'].mean()\n",
    "average_bleu"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "5806a98c-7934-4b11-a616-38131ade7b47",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "df_vquanda.to_csv('Output/exp1_misteral_vquanda.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "91a0c4a5-157a-4f43-84e4-4e0ef6c0bcde",
   "metadata": {},
   "source": [
    "### Experiments on GammaCode "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "9b0ef92c-1330-41d3-b036-b0949309f2c1",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BLEU score: 0.1370643416731807\n"
     ]
    }
   ],
   "source": [
    "\n",
    "import nltk\n",
    "from nltk.translate.bleu_score import sentence_bleu\n",
    "\n",
    "# Example reference and candidate sentences\n",
    "reference = df_vquanda['sparql_vquanda'].iloc[0]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "b189fa92-fab9-4334-b37b-7392709cec57",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson> . ?uri <http://dbpedia.org/ontology/knownFor> ?x  . }'"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_vquanda['sparql_vquanda'].iloc[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "721954fc-9ab1-44cd-8898-f744697e39d5",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\n    Prefix dbo: <http://dbpedia.org/ontology/dbpedia-base+v2.0/>\\n    Prefix dbo: (DBPedia ontology prefix)\\n    Prefix dbp: <http://dbpedia.org/ontology/data/dbp/> \\n\\n    SELECT COUNT(distinct dbo:subject) as Number_of_People\\n    WHERE {\\n   ?person dbo:hasOccupation?occupation.\\n   ?person dbo:role?role.\\n   ?person dbo:birthPlace?place.\\n   ?person dbo:alive?date.\\n   ?person dbo:hasCommander?commander.\\n   ?occupation dbo:isSubclassOf?type.\\n   ?occupation dbo:isAmbiguous 0.\\n   ?type dbo:isSubclassOf <http://dbpedia.org/ontology/dbpedia-base+v2.0/person>.\\n   ?commander wdt:itemType?type.\\n   ?commander dbo:influence?numberOfYears.\\n   ?commander dbo:started?date.\\n   ?commander dbo:ended?date.\\n   ?commander dbo:militaryRank?rank.\\n   ?commander dbo:country?country.\\n   ?commander dbo:birthPlace?place.\\n   ?commander dbo:name?name.\\n    FILTER(str(?commander) = \"Andrew Jackson\" && str(?date) <= str(date(now))){\\n    }\\n    }\\n    '"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_vquanda['mistral_sparql'].iloc[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "925d526b-b09f-4639-a30a-57eabed7d81e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.0"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_vquanda['Org_bleu_score'].iloc[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "242539fe-dd47-4c54-9c72-3f086f7cf7b4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BLEU score: 1.459722779833038e-78\n"
     ]
    }
   ],
   "source": [
    "import nltk\n",
    "from nltk.translate.bleu_score import sentence_bleu\n",
    "\n",
    "# Example reference and candidate sentences\n",
    "reference = nltk.word_tokenize(df_vquanda['sparql_vquanda'].iloc[0].lower())\n",
    "candidate = nltk.word_tokenize(df_vquanda['mistral_sparql'].iloc[0].lower())\n",
    "\n",
    "# Calculate BLEU score\n",
    "bleu_score = sentence_bleu([reference], candidate)\n",
    "\n",
    "print(\"BLEU score:\", bleu_score)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3d5e0ce-fd98-404a-9f19-83f7547e6d48",
   "metadata": {},
   "outputs": [],
   "source": [
    "BLEU score: 1.459722779833038e-78"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "21445b63-f166-49f5-ab4f-b03a3f925f0f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "sparqlgen",
   "language": "python",
   "name": "sparqlgen"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
